```
Terraform will perform the following actions:

  # aws_ssm_parameter.proxygen_private_key will be created
  + resource "aws_ssm_parameter" "proxygen_private_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "312e6bf8-5c33-4f8d-8675-219f63efcfb5"
      + name           = "/dev/proxygen/private_key"
      + tags           = {
          + "Stack" = "Networking"
        }
      + tags_all       = {
          + "ApplicationRole"     = "API"
          + "CostCentre"          = "129117"
          + "Customer"            = "NHS England"
          + "DataType"            = "PII"
          + "Environment"         = "dev"
          + "FinOpsTagVersion"    = "1"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "edd.almond1@nhs.net"
          + "Product"             = "EligibilitySignpostingAPI"
          + "Programme"           = "Vaccinations"
          + "ProjectType"         = "Production"
          + "PublicFacing"        = "Y"
          + "ServiceCategory"     = "Silver"
          + "Stack"               = "Networking"
          + "Tool"                = "Terraform"
          + "data_classification" = "5"
          + "workspace"           = "default"
        }
      + tier           = "Advanced"
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
